In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('fortune_2000_in_2021.csv')

# Check column info

- As you can see below, we only have 1999 non null rows in the 'Assets' column while there are 2000 non null columns elsewhere.

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2000 entries, 0 to 1999
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Rank          2000 non-null   int64
 1   Name          2000 non-null   object
 2   Country       2000 non-null   object
 3   Sales         2000 non-null   object
 4   Profit        2000 non-null   object
 5   Assets        1999 non-null   object
 6   Market Value  2000 non-null   object
dtypes: int64(1), object(6)
memory usage: 109.5+ KB

# Find and replace null values
- Here we can see that the Bank of Greece has NaN under its assets column.

In [4]:
df[df['Assets'].isnull()]

      Rank            Name Country   Sales    Profit Assets Market Value
1932  1933  Bank of Greece  Greece  $1.3 B  $942.8 M    NaN       $366 M

- For further filtering and sorting, we are going to replace NaN with 0.

In [5]:
df['Assets'] = df['Assets'].fillna(0)
# Check row
df.loc[1932]

Rank                      1933
Name            Bank of Greece
Country                 Greece
Sales                   $1.3 B
Profit                $942.8 M
Assets                       0
Market Value            $366 M
Name: 1932, dtype: object

# Inspect Countries for any spelling errors

In [6]:
# Change max option to view all countries
pd.set_option ('display.max_rows', 61)

# Get unique countries by performing value counts
countries = pd.DataFrame(df['Country'].value_counts())
countries.sort_index()

                      Country
Argentina                   2
Australia                  31
Austria                     9
Bahrain                     1
Bangladesh                  1
Belgium                     9
Bermuda                     6
Brazil                     21
Canada                     56
Chile                       5
China                     291
Colombia                    3
Cyprus                      1
Czech Republic              1
Denmark                    12
Egypt                       1
Finland                     9
France                     53
Germany                    54
Greece                      5
Hong Kong                  59
Hungary                     2
India                      50
Indonesia                   6
Ireland                    18
Israel                     10
Italy                      23
Japan                     215
Kazakhstan                  2
Kenya                       1
Kuwait                      3
Luxembourg                  6
Malaysia                    8
Mexico                     10
Monaco                      1
Morocco                     3
Netherlands                20
Nigeria                     2
Norway                      8
Oman                        1
Peru                        1
Philippines                 6
Poland                      7
Portugal                    4
Qatar                       6
Russia                     24
Saudi Arabia               13
Singapore                   9
South Africa               15
South Korea                62
Spain                      21
Sweden                     32
Switzerland                42
Taiwan                     45
Thailand                   14
Turkey                      9
United Arab Emirates        9
United Kingdom             66
United States             590
Venezuela                   1
Vietnam                     5

In [7]:
# Set max rows back to previous
pd.set_option ('display.max_rows', 10)

# Check all numerical columns have the same format
### Checking if Sales, Profits, Assets and Market Value all contain $ and M or B

- Before we convert rows to numerical formats, we want to check the existing rows all have the same format.
- We want to check they all contain $ and M or B

In [8]:
# Expecting a length of 2000 
len(df[df['Sales'].str.contains('$', na=False) & (df['Sales'].str.contains('B|M',na=False))])

2000

In [9]:
# Expecting a length of 2000 
len(df[df['Profit'].str.contains('$',na=False) & (df['Profit'].str.contains('B|M',na=False))])

2000

In [10]:
# Expecting a length of 2000 
len(df[df['Assets'].str.contains('$',na=False) & (df['Assets'].str.contains('B|M',na=False))])

1999

In [11]:
# Expecting a length of 2000 
len(df[df['Market Value'].str.contains('$',na=False) & (df['Market Value'].str.contains('B|M',na=False))])

2000

# Find and fix 1 row with Assets in incorrect format

- From above we only have a length of 1999 for Asset column strings containing $ and M or B.
- From earlier we set the Bank of Greece 'Assets' to 0 (an integer)
- Here we use na=False to get any NaN or non string items.

In [12]:
#df.loc[(df['Assets'].str.contains("M")) & (~df['Assets'].str.contains("B"))]
df[df['Assets'].str.contains('$', na=False) == False]

      Rank            Name Country   Sales    Profit Assets Market Value
1932  1933  Bank of Greece  Greece  $1.3 B  $942.8 M      0       $366 M

In [13]:
# Here we will set the 'Assets' column to have the same string format as other cells.
df.at[1932,'Assets'] = '$0 M'
# Check row
df.loc[1932]

Rank                      1933
Name            Bank of Greece
Country                 Greece
Sales                   $1.3 B
Profit                $942.8 M
Assets                    $0 M
Market Value            $366 M
Name: 1932, dtype: object

# Check for possible anomalies 
### Checking if profit is in billions but sales are in millions

- Although the data is from a practice dataset, in this situation we might want to double check with team members that the data below is correct.

In [14]:
# Change option for displaying max rows
pd.set_option ('display.max_rows', 100)
# Find all rows where profits are in billions but sales are in millions
df[df['Sales'].str.contains('M') & df['Profit'].str.contains('B')]

,Rank,Name,Country,Sales,Profit,Assets,Market Value
605,606,Porsche Automobil Holding,Germany,$122 M,$3 B,$44.5 B,$36.2 B
1037,1036,Segro,United Kingdom,$554 M,$1.8 B,$17.3 B,$16.2 B
1074,1075,Kinnevik,Sweden,$575 M,$4.4 B,$14.1 B,$15.5 B
1113,1114,Carnival,United States,$831 M,$-11.4 B,$57.2 B,$30.6 B
1384,1384,Sofina,Belgium,$97 M,$1.6 B,$11.1 B,$12.4 B
1584,1585,Sparebanken Nord-Norge,Norway,$481 M,$2 B,$13.7 B,$1 B
1639,1640,RMB Holdings,South Africa,$2 M,$2 B,$330 M,$191 M
1677,1678,Cannae Holdings,United States,$586 M,$1.8 B,$4.6 B,$3.8 B
1708,1708,Iluka Resources,Australia,$715 M,$1.7 B,$2 B,$2.4 B
1803,1804,China Conch Venture Holdings,China,$960 M,$1.1 B,$8.3 B,$8.7 B
1881,1882,Brilliance China Automotive Holdings,Hong Kong,$485 M,$1.1 B,$7.6 B,$4.7 B
1885,1886,First Heartland Jusan Bank,Kazakhstan,$533 M,$1.1 B,$3.8 B,$323 M
1914,1915,BeiGene,China,$309 M,$-1.6 B,$5.6 B,$28.4 B

In [15]:
#Set the max rows option back again
pd.set_option ('display.max_rows', 10)

# Save the cleaned dataframe to a file
- Here, we save dataframe to csv without the index 
- An index will be created when we re-open file

In [16]:
df.to_csv('fortune_2000_in_2021_cleaned.csv', index=False)